InformationRegisters/СостоянияВыполненияЗадачМТСКоординатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СостоянияВыполненияЗадачМТСКоординатор</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>IDЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗадачМТСКоординатор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЗадачМТСКоординатор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыЗадачМТСКоординатор</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принята</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОтправлена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СостоянияВыполненияЗадачМТСКоординатор/Forms/ФормаОтправкиЗаданийМТСКоординатор/Ext/Form/Module.bsl
#Область СобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДокументОснование") Тогда
		ДокументОснованиеЗагрузочнаяВедомость = Параметры.ДокументОснование;
		ЗаполнитьТЧДокументами();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область КомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПолучитьМассивСтруктурОтправки()
	
	МассивОтправки = Новый Массив();
	Для Каждого Строка Из ТЧДокументыДляВыгрузки Цикл
		Если НЕ Строка.Выбран Тогда
			Продолжить
		КонецЕсли;
		Если Строка.Водитель = Справочники.реа_Водители.ПустаяСсылка() Тогда
			Сообщить(Строка(Строка.Документ)+" не отправлен, не заполнен водитель!");
			Продолжить
		КонецЕсли;
		СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("IdАбонента",Строка.Водитель.IdАбонента);
		СтруктураСтроки.Вставить("IdЗадачи",?(Строка.IDЗадачи = "Новая задача","-1",Строка.IDЗадачи));
		СтруктураСтроки.Вставить("Адрес" ,Строка.Адрес);
		ЗаголовокЗадачи ="Акт выдачи №"+""+ ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(Строка.Документ.Номер) + " " + Строка.ФИОПолучателя;
		СтруктураСтроки.Вставить("Заголовок", ЗаголовокЗадачи);
		СтруктураСтроки.Вставить("Клиент", Строка.ФИОПолучателя);     
		СтруктураСтроки.Вставить("Описание","Выдача ТСР");
		СтруктураСтроки.Вставить("Телефон",Строка.Документ.Заявитель.Телефон);
		СтруктураСтроки.Вставить("Документ", Строка.Документ);
		СтруктураСтроки.Вставить("ВремяНачала", НачалоДня(ТекущаяДата())) ;
		СтруктураСтроки.Вставить("ВремяКонца", КонецДня(ТекущаяДата())) ;
				
		Если строка.Приоритет = "Низкий" Тогда
			Приоритет = 0;
		ИначеЕсли строка.Приоритет = "Средний" Тогда
			Приоритет = 1;
		Иначе
			Приоритет = 2;
		КонецЕсли;	
		
		СтруктураСтроки.Вставить("Приоритет", Приоритет);
		МассивОтправки.Добавить(СтруктураСтроки);
	КонецЦикла;
	Возврат МассивОтправки;
КонецФункции

&НаСервере
Процедура ЗаполнитьТЧДокументами()
	
	Если ТипЗнч(ДокументОснованиеЗагрузочнаяВедомость) = Тип("ДокументСсылка.ЗагрузочнаяВедомостьТСР") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СостоянияВыполненияЗадачМТСКоординаторСрезПоследних.Документ,
		|	МАКСИМУМ(СостоянияВыполненияЗадачМТСКоординаторСрезПоследних.Период) КАК Период
		|ПОМЕСТИТЬ ПоследнийСтатусДокумента
		|ИЗ
		|	РегистрСведений.СостоянияВыполненияЗадачМТСКоординатор.СрезПоследних КАК СостоянияВыполненияЗадачМТСКоординаторСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	СостоянияВыполненияЗадачМТСКоординаторСрезПоследних.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(СостоянияВыполненияЗадачМТСКоординатор.Статус) КАК Статус,
		|	ПоследнийСтатусДокумента.Документ,
		|	СостоянияВыполненияЗадачМТСКоординатор.Приоритет,
		|	СостоянияВыполненияЗадачМТСКоординатор.IDЗадачи
		|ПОМЕСТИТЬ ТекущийСтатусДокумента
		|ИЗ
		|	РегистрСведений.СостоянияВыполненияЗадачМТСКоординатор КАК СостоянияВыполненияЗадачМТСКоординатор
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследнийСтатусДокумента КАК ПоследнийСтатусДокумента
		|		ПО СостоянияВыполненияЗадачМТСКоординатор.Период = ПоследнийСтатусДокумента.Период
		|			И СостоянияВыполненияЗадачМТСКоординатор.Документ = ПоследнийСтатусДокумента.Документ
		|
		|СГРУППИРОВАТЬ ПО
		|	ПоследнийСтатусДокумента.Документ,
		|	СостоянияВыполненияЗадачМТСКоординатор.Приоритет,
		|	СостоянияВыполненияЗадачМТСКоординатор.IDЗадачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗагрузочнаяВедомостьТСРАкты.Акт КАК Документ,
		|	ЕСТЬNULL(ТекущийСтатусДокумента.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыЗадачМТСКоординатор.НеОтправлена)) КАК Статус,
		|	ЛОЖЬ КАК Выбран,
		|	ЗагрузочнаяВедомостьТСРАкты.Акт.Заявитель.Наименование КАК ФИОПолучателя,
		|	ВЫБОР
		|		КОГДА ЗагрузочнаяВедомостьТСРАкты.Акт.Заявитель.АдресМестожительства = """"
		|			ТОГДА ЗагрузочнаяВедомостьТСРАкты.Акт.Заявитель.АдресРегистрации
		|		ИНАЧЕ ЗагрузочнаяВедомостьТСРАкты.Акт.Заявитель.АдресМестожительства
		|	КОНЕЦ КАК Адрес,
		|	ЗагрузочнаяВедомостьТСРАкты.Ссылка.Водитель,
		|	ЕСТЬNULL(ТекущийСтатусДокумента.Приоритет, 1) КАК Приоритет,
		|	ЗагрузочнаяВедомостьТСРАкты.Ссылка.Дата КАК ДокументДата,
		|	ЕСТЬNULL(ТекущийСтатусДокумента.IDЗадачи, ""Новая задача"") КАК IdЗадачи,
		|	ЗагрузочнаяВедомостьТСРАкты.Акт.Заявитель.Телефон КАК Телефон
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	Документ.ЗагрузочнаяВедомостьТСР.Акты КАК ЗагрузочнаяВедомостьТСРАкты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТекущийСтатусДокумента КАК ТекущийСтатусДокумента
		|		ПО ЗагрузочнаяВедомостьТСРАкты.Акт = ТекущийСтатусДокумента.Документ
		|ГДЕ
		|	ЗагрузочнаяВедомостьТСРАкты.Ссылка = &ЗагрузочнаяВедомость
		|	И ЗагрузочнаяВедомостьТСРАкты.Акт.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговаяТаблица.Статус КАК Статус,
		|	ИтоговаяТаблица.Выбран,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.Приоритет = 0
		|			ТОГДА ""Низкий""
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ИтоговаяТаблица.Приоритет = 1
		|					ТОГДА ""Средний""
		|				ИНАЧЕ ""Высокий""
		|			КОНЕЦ
		|	КОНЕЦ КАК Приоритет,
		|	ИтоговаяТаблица.Документ,
		|	ИтоговаяТаблица.ФИОПолучателя,
		|	ИтоговаяТаблица.Адрес,
		|	ИтоговаяТаблица.Водитель,
		|	ИтоговаяТаблица.ДокументДата,
		|	ИтоговаяТаблица.IdЗадачи КАК IdЗадачи,
		|	ИтоговаяТаблица.Телефон
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица";
		
		Запрос.УстановитьПараметр("ЗагрузочнаяВедомость",ДокументОснованиеЗагрузочнаяВедомость);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		ТЧДокументыДляВыгрузки.Загрузить(РезультатЗапроса);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДокументыВМТСКоординатор(Команда)
	МассивСтруктурОтправки = ПолучитьМассивСтруктурОтправки();
	//РезультатОтправки      = ОтправитьДокументыМТСКоординатор(МассивСтруктурОтправки);
	//ОбработатьРезультатОтправки(РезультатОтправки);
	Для каждого документ из МассивСтруктурОтправки Цикл
		Если Документ.IDАбонента = "" Тогда
			Сообщить("Заполните реквизит ""ID абонента"" в карточке водителя");
			Продолжить;
		КонецЕсли;
		Ответ = ИнтеграцияМТСКлиент.СохранитьЗадачу(документ);
		Если Ответ.Статус = 200 Тогда
			ИнтеграцияМТСКлиент.ЗаписатьВРегистрСостоянияВыполненияЗадачМТСКоординатор(документ.Документ, "Отправлена", Ответ.IDЗадачи, ТекущаяДата()-1, документ.Приоритет);
		Иначе 
			Сообщить(Строка(Документ.Документ) + " Код ошибки :" + Ответ.Статус);
		КонецЕсли;		
	КонецЦикла;	

КонецПроцедуры


&НаКлиенте
Процедура УстановитьВсеФлажки(Команда)
	Для каждого Строка ИЗ ТЧДокументыДляВыгрузки Цикл
		Строка.Выбран = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеФлажки(Команда)
	Для каждого Строка ИЗ ТЧДокументыДляВыгрузки Цикл
		Строка.Выбран = Ложь;
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	МассивЗадач = ИнтеграцияМТСКлиент.ПолучитьАктивныеЗадачи();		
	Ответ = ИнтеграцияМТСКлиент.ПолучитьИзмененияПоМассивуЗадач(МассивЗадач);	
	ЗаполнитьТЧДокументами();
КонецПроцедуры

#КонецОбласти
